app/views/events/edit.html.erb

          <%= submit_tag 'Update Event Info', :class => 'inline-flex justify-center rounded-md border border-transparent bg-green-600 py-2 px-4 text-sm font-medium text-white shadow-sm hover:bg-green-700 focus:outline-none focus:ring-2 focus:ring-green-500 focus:ring-offset-2' %>
          <%= link_to 'Cancel', organizer_events_path('organizer_id': Organizer.find_by(id: session[:organizer_id]).id), :class => 'inline-flex justify-center rounded-md border border-transparent bg-red-600 py-2 px-4 text-sm font-medium text-white shadow-sm hover:bg-red-700 focus:outline-none focus:ring-2 focus:ring-red-500 focus:ring-offset-2' %>
---
SELECT "organizers".* FROM "organizers" WHERE "organizers"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]