app/views/events/show.html.erb

  <%= link_to 'Delete', event_path(@event), 'data-method' => 'delete', 'data-confirm' => 'Are you sure?', :class => 'btn btn-danger col-2' %>
  <%= link_to 'Back to event list', organizer_events_path('organizer_id': Organizer.find_by(id: session[:organizer_id]).id), :class => 'btn btn-primary col-2' %>
---
SELECT "organizers".* FROM "organizers" WHERE "organizers"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]