app/controllers/events_controller.rb

  def index
    student_id = session[:student_id]
    id = params[:id]
    @student = Student.find(student_id)
---
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]

  def edit
    @event = Event.find params[:id]
    @all_tags = Event.all_tags
    @tags_to_show = @event.tags
    relevant_tags = @tags_to_show - ["Free Food"]
    @total_students = Student.where('tags && array[?]', relevant_tags).count
---
SELECT COUNT(*) FROM "students" WHERE (tags && array['Freshman','Sophomore','Junior','STEM','Humanities'])