app/controllers/events_controller.rb

  def show
    id = params[:id] # retrieve event ID from URI route
    @event = Event.find(id) # look up event by unique ID
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 68], ["LIMIT", 1]]

  def student_show
    id = params[:id] # retrieve event ID from URI route
    @event = Event.find(id) # look up event by unique ID
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 68], ["LIMIT", 1]]

  def index
    @events = Event.all
---
SELECT "events".* FROM "events" WHERE (array_length(tags, 1) is NULL OR tags && array['Freshman','Sophomore','Junior','Senior','STEM','Humanities','Free Food'])

  def organizer_index
    @events = Event.where(organizer_id: params[:organizer_id])
---
SELECT "events".* FROM "events" WHERE "events"."organizer_id" = $1  [["organizer_id", 30]]

  def create
    @organizer = Organizer.find_by(id: session[:organizer_id])
    @event = @organizer.events.create(event_params)
---
SELECT "organizers".* FROM "organizers" WHERE "organizers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "events" ("name", "datetime", "location", "description", "tags", "organizer_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "test"], ["datetime", "2022-11-12 17:21:00"], ["location", "test"], ["description", ""], ["tags", "{Freshman,Sophomore,Junior,Senior,Humanities,\"Free Food\"}"], ["organizer_id", 1]]

  def edit
    @event = Event.find params[:id]
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 68], ["LIMIT", 1]]

  def update
    @event = Event.find params[:id]
    @event.update(event_params)
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 68], ["LIMIT", 1]]
UPDATE "events" SET "location" = $1, "tags" = $2 WHERE "events"."id" = $3  [["location", "Butler"], ["tags", "{Humanities,Sophomore}"], ["id", 559]]

  def destroy
    @organizer = Organizer.find_by(id: session[:organizer_id])
    @event = Event.find(params[:id])
    @event.destroy
---
SELECT "organizers".* FROM "organizers" WHERE "organizers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 4]]