app/controllers/organizers_controller.rb

SELECT "organizers".* FROM "organizers" WHERE "organizers"."email" = $1 LIMIT $2  [["email", "all"], ["LIMIT", 1]]
INSERT INTO "organizers" ("name", "email", "password") VALUES ($1, $2, $3) RETURNING "id"  [["name", "all"], ["email", "all"], ["password", "pass"]]
---
    def create
      puts "PARAMS"
      puts params
      @existing_org = Organizer.find_by(email: params[:organization][:email])
      if (params[:organization][:name] == "" || params[:organization][:email] == "" || params[:organization][:password] == "")
        flash[:notice] = "Please fill out all of the fields."
        redirect_to root_path
      elsif (@existing_org != nil)
        flash[:notice] = "An account with this UNI already exists. Please login instead. "
        redirect_to root_path
      else
        @organization = Organizer.create!(organization_params)

SELECT "organizers".* FROM "organizers" WHERE "organizers"."email" = $1 LIMIT $2  [["email", "swe@gmail.com"], ["LIMIT", 1]]
---
    def login
      @organization = Organizer.find_by(email: params[:organization][:email])