app/controllers/students_controller.rb

SELECT "students".* FROM "students" WHERE "students"."uni" = $1 LIMIT $2  [["uni", ""], ["LIMIT", 1]]
INSERT INTO "students" ("uni", "name", "password") VALUES ($1, $2, $3) RETURNING "id"  [["uni", "sv26111"], ["name", "New Shruti"], ["password", "password"]]
---
    def create
      @existing_student = Student.find_by(uni: params[:create_student][:uni])
      if (params[:create_student][:uni] == "" || params[:create_student][:name] == "" || params[:create_student][:password] == "")
        flash[:notice] = "Please fill out all of the fields."
        redirect_to root_path
      elsif (@existing_student != nil)
        flash[:notice] = "An account with this email already exists. Please login instead. "
        redirect_to root_path
      elsif (!params[:create_student][:uni].match?(/[a-z]+[0-9]+@columbia.edu/))
        flash[:notice] = "Please enter a valid Columbia student email."
        redirect_to root_path
      else
        @student = Student.create!(student_params)

SELECT "students".* FROM "students" WHERE "students"."uni" = $1 LIMIT $2  [["uni", "sv2611"], ["LIMIT", 1]]
---
    def login
      @student = Student.find_by(uni: params[:student][:uni])

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 68], ["LIMIT", 1]]
SELECT 1 AS one FROM "events" INNER JOIN "events_students" ON "events"."id" = "events_students"."event_id" WHERE "events_students"."student_id" = $1 AND "events"."id" = $2 LIMIT $3  [["student_id", 28], ["id", 68], ["LIMIT", 1]]
---
    def add_event
      @student = Student.find(session[:student_id])
      @event = Event.find(params[:id])
      if (@student.events.include?(@event))

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 68], ["LIMIT", 1]]
---
    def remove_event
      @student = Student.find(session[:student_id])
      @event = Event.find(params[:id])

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
---
    def my_events
      @student = Student.find(session[:student_id])

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
---
    def my_profile
      @student = Student.find(session[:student_id])

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
---
    def show_schedule
      @student = Student.find(session[:student_id])

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
---
    def edit_schedule
      @student = Student.find(session[:student_id])

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
INSERT INTO "timeblocks" ("busy_range", "created_at", "updated_at", "student_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["busy_range", "[1996-01-01 00:00:00,1996-01-01 23:59:00]"], ["created_at", "2022-11-12 15:08:09.224535"], ["updated_at", "2022-11-12 15:08:09.224535"], ["student_id", 28]]
---
    def update_schedule
      @student = Student.find(session[:student_id])
      weekday = timeblock_params[:weekday]
      start_hour = timeblock_params[:busy_start][11,2]
      start_min = timeblock_params[:busy_start][14,2]
      end_hour = timeblock_params[:busy_end][11,2]
      end_min =  timeblock_params[:busy_end][14,2]
      if weekday == "Monday"
        d = Date.new(1996,1,1)
      elsif weekday == "Tuesday"
        d = Date.new(1996,1,2)
      elsif weekday == "Wednesday"
        d = Date.new(1996,1,3)
      elsif weekday == "Thursday"
        d = Date.new(1996,1,4)
      elsif weekday == "Friday"
        d = Date.new(1996,1,5)
      elsif weekday == "Saturday"
        d = Date.new(1996,1,6)
      else
        d = Date.new(1996,1,7)
      end
      start_datetime = DateTime.new(d.year, d.month, d.day, start_hour.to_i, start_min.to_i)
      end_datetime = DateTime.new(d.year, d.month, d.day, end_hour.to_i, end_min.to_i)
      if start_datetime >= end_datetime
        flash[:notice] = "Please enter a valid timeblock."
      else
        @student.timeblocks.create(busy_range: (start_datetime..end_datetime))

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
SELECT "timeblocks".* FROM "timeblocks" WHERE "timeblocks"."student_id" = $1 AND "timeblocks"."id" = $2 LIMIT $3  [["student_id", 28], ["id", 1], ["LIMIT", 1]]
---
    def remove_timeblock
      @student = Student.find(session[:student_id])
      @timeblock = @student.timeblocks.find(params[:id])

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
UPDATE "students" SET "tags" = $1 WHERE "students"."id" = $2  [["tags", "{Senior,STEM,Humanities}"], ["id", 28]]
---
    def update
      @student = Student.find(params[:id])
      tags_array = []
      if (params[:tags])
        params_array = params[:tags].keys
        for tag in params_array
          tags_array.append(tag)
        end
      end
      @student.update(:tags => tags_array)