app/controllers/students_controller.rb

    def show
      id = params[:id] # retrieve event ID from URI route
      @student = Student.find(id) # look up event by unique ID
---
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]